// [BOJ11003] 최솟값 찾기 / 플래티넘5 / 덱 / 1176 ms / 43588 KB

/*
    문제 입,출력
        - N :   ~ 5'000'000     int
        - L :   ~ 5'000'000     int

        시간 제한은 2.4 초 ~= 2.4억 ~ 5억 |     O(N) O(lgN) O(1)


    문제 방향
        - 1. N을 입력받는다. O(N)
        - 2. Min 을 L 만큼 범위 검사 하면 O(N)
            -> O(N^2) 시발 실패

     ======================== O(N^2)=====================
    // for(int i = 0 ; i < n ; i ++) {
    //     int k;
    //     cin >> k;
    //     dq.push_back(k);
    // }
    // for(int i = 0 ; i < l -1 ; i ++) dq.push_front(INT_MAX);


    // for(int i = 0 ; i < n ; i ++){  // O(N)
    //     int mn = *min_element(dq.begin()+i,dq.begin()+i+l);     // O(N=l)
    //     cout << mn << ' ';
    // }
     ======================== O(N^2)=====================

        ======================================================
        - 1. N을 입력받을때, Min을 매번 갱신 하면 O(N + N) 
            -> l 길이를 알 수 없음.

        ======================================================

        - 1. N을 입력받을때, 딱 3개씩만 받는다.
        - 2. 오름차순 정렬식으로 유지하면서 덱에 넣으면 ~=O(N)
            입력값 과 맨 뒤 값을 비교하여 입력값 <= 뒤 면 제거 
            입력값은 뒤로 삽입
            인덱스를 활용해 지나간 것들은 지나간대로.


        1 5 2 3 6 2 3 7 3 5 2 6
        
        (0,1) 
        (0,1) (1,5) 
        (0,1) (2,2)
        (2,2) (3,3) <===  outdate 라 idx 0 제거 
        (2,2) (3,3) (4,6)
        (5,2)     <== idx 2,3,4 제거 
        (5,2) (6,3) 
        (5,2) (6,3) (7,7)
        (8,3)       <== 5,6,7 제거
        (8,3) (9,5) 
        (10,2)      <== 8,9 제거
        (10,2) (11,6)
        
*/

#include<bits/stdc++.h>
using namespace std;

struct E{int idx,num;};
int n;
int l;
deque<E> dq;
int k;
int main(void){
    cin.tie(0);
    ios::sync_with_stdio(0);

    cin >> n >> l ;

    for(int i = 0 ; i < n ; i ++){
        cin >> k;
        
        while(!dq.empty() && dq.back().num >= k) dq.pop_back(); // 오름차순 정렬을 위해 (앞 쪽과 뒤 쪽중 뒤 쪽을 제거)
        dq.push_back({i,k});        // 신상은 뒤쪽으로 삽입.
        if(dq.front().idx <= i - l) dq.pop_front(); // 지나간 것은 지나간대로
        cout << dq.front().num << ' ' ;  // 항상 앞쪽은 제일 작은 원소.
    }
}


